In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv('/content/Salaries.csv')

In [ ]:
df

            Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]

In [ ]:
df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

what is the average BasePay?

In [ ]:
df['BasePay'].mean()

66325.44884050643

what is the highest amount of OvertimePay in the dataset?

In [ ]:
df['OvertimePay'].max()

245131.88

what is the job title of JOSEPH DRISCOLL? Note: Use all caps,otherwise you may get answer that doesn't match up

In [ ]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'	]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

HOW MUCH DOES JOSEPH DRISCOLL MAKE(INCLUDING BENEFITS)?

In [ ]:
df['TotalPayBenefits'] [df['EmployeeName']== 'JOSEPH DRISCOLL']

24    270324.91
Name: TotalPayBenefits, dtype: float64

WHAT IS THE NAME OF THE HIGHEST PAID PERSON(INCLUDING BENEFITS)?

In [ ]:
df[df['TotalPay'].max()==df['TotalPay']]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

WHAT IS THE NAME OF THE LOWEST PAID PERSON(INCLUDING BENEFITS)?

In [ ]:
df[df['TotalPay'].min()==df['TotalPay']]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

WHAT WAS THE AVERAGE(MEAN) BasePay OF ALL EMPLOYEES PER YEAR? (2011-2014)

In [ ]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

HOW MANY UNIQUE JOB TITLES ARE THERE?

In [ ]:
df['JobTitle'].nunique()

2159

WHAT ARE THE TOP 5 MOST COMMON JOBS?

In [ ]:
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

HOW MANY JOB TITLES WERE REPRESENTED BY ONLY ONE PERSON IN 2013?(EG: JOB TITLE WITH ONLY ONE OCCURENCE IN 2013)

In [ ]:
(df[df['Year']==2013]['JobTitle'].value_counts()==1).sum()

202

HOW MANY PEOPLE HAVE THE WORD CHIEF IN THEIR JOB TITLE?

In [ ]:
df['JobTitle'].apply(lambda str:('chief' in str.lower())).sum()

627

In [ ]:

def find_chief(job_title):    
    if 'chief' in job_title.lower().split():
        return True
    else:
        return False

df = pd.read_csv('Salaries.csv')

sum(df['JobTitle'].apply(lambda x: find_chief(x)))

477

# **RESULT:**
The program executed successfully and obtained the output.